{
	"app_mentions:read": "This enables the bot to provide summaries or answer questions when users tag it with links or queries.",
	"channels:history": "The bot needs this to detect and summarize shared links in public discussions and allow users to interact with linked resources.",
	"channels:read": "This helps the bot determine which channels it has access to and where it should monitor discussions for shared links.",
	"chat:write": "This permission is required for the bot to post summaries, answer follow-up questions, and facilitate interactions with linked content.",
	"files:read": "This enbles us to analyze and enrich files uploaded to a channel, similar to other external resources",
	"groups:history": "This enables the bot to summarize links and facilitate discussions within private channels while respecting workspace privacy settings.",
	"groups:read": "The bot needs to identify where it can operate within private channels and ensure it functions only where authorized.",
	"groups:write": "This permission is required for the bot to post summaries, answer follow-up questions, and facilitate interactions with linked content.",
	"im:history": "This ensures the bot can summarize links and answer questions in one-on-one conversations, enhancing personal research assistance.",
	"im:read": "Our Slack app requests the im:read permission to access direct message history, enabling it to understand user queries, provide relevant scientific insights, and enhance interactions within private conversations. This ensures seamless AI-powered assistance tailored to individual user needs.",
	"im:write": "This permission is required for the bot to post summaries, answer follow-up questions, and facilitate interactions with linked content.",
	"links:read": "This enables the bot to detect and summarize shared links in public discussions and allow users to interact with linked resources.",
	"links:write": "This permission is required for the bot to post summaries, answer follow-up questions, and facilitate interactions with linked content.",
	"mpim:history": "The bot needs this to analyze shared links and respond to queries in group DMs, ensuring seamless collaboration on research topics.",
	"reactions:read": "This enables curation of external resources by analyzing team interaction with the ressource",
	"assistant:write": "Reason: Our Slack app requests the assistant:write permission to enable AI-powered interactions, allowing users to ask questions, summarize research, and stay updated on scientific topics. This permission allows the app to function as an AI assistant, responding to queries and facilitating discussions within Slack."
}
